"""Домашнє завдання №1
Привіт! Сьогодні ви виконуєте першу домашку. Вона складається з двох частин і може видатися досить об'ємною, але немає потреби хвилюватися, оскільки ми детально розписали підказки та рекомендації щодо виконання.

Одже, сьогодні ви:

реалізуєте функцію для виведення списку колег, яких потрібно привітати з днем народження на тижні (чудова річ, доречі, тепер точно не забудете нікого привітати)
напишете бота-асистента, яки зможе розпізнавати команди, що вводяться з клавіатури, та буде відповідати відповідно до введеної команди.
Загальнi критерії приймання
Створено репозиторій goitneo-python-hw-1-назвагрупи
Домашня робота містить посилання на репозиторiй на GitHub та прикрiплений файл репозиторію у форматi zip.
Завдання виконані у точній відповідності до технiчного опису (рекомендацiї для виконання та критерії оцінювання).
В консолі відсутні помилки і попередження під час запуску бота.
Імена змінних і функцій - зрозумілі та описові.
Код відформатований та відповідає стандарту PEP8.
Формат оцінювання
Оцінка від 0 до 100
Формат здачі
Посилання на репозиторій на Github.
Прикрiплений файл репозиторію у форматi zip.
ВАЖЛИВО
Перегляньте Iнструкцію щодо завантаження робочого файлу з репозиторію на Github
"""