"""ЗАВДАННЯ: НАДІЙНІСТЬ ПАРОЛЯ"""

'''
Другий етап. Необхідно написати функцію is_valid_password, яка перевірятиме отриманий параметр — пароль на надійність.

Критерії надійного пароля:

Довжина рядка пароля вісім символів.
Містить хоча б одну літеру у верхньому регістрі.
Містить хоча б одну літеру у нижньому регістрі.
Містить хоча б одну цифру.
Функція is_valid_password повинна повернути True, якщо переданий параметр пароль відповідає вимогам на надійність. Інакше повернути False.
'''
def is_valid_password(password):
    # Перевірка довжини пароля
    if len(password) != 8:
        return False

    # Перевірка наявності літер у верхньому, нижньому регістрі та цифр
    has_upper = any(char.isupper() for char in password)
    has_lower = any(char.islower() for char in password)
    has_digit = any(char.isdigit() for char in password)

    # Перевірка, що всі критерії виконані
    if has_upper and has_lower and has_digit:
        return True
    else:
        return False

# Приклад використання:
password_to_check = "Abc12345"
result = is_valid_password(password_to_check)
print("Надійність пароля:", result)
#    Ця функція перевіряє, чи виконуються критерії надійності пароля:
#
#    Довжина пароля повинна бути 8 символів.
#    Пароль повинен містити хоча б одну літеру у верхньому регістрі.
#    Пароль повинен містити хоча б одну літеру у нижньому регістрі.
#    Пароль повинен містити хоча б одну цифру.
#    Якщо всі критерії виконані, функція повертає True, інакше - False.