"""
Функція — це окремий блок чи фрагмент програми. Вони служать у програмах декільком цілям. Головна ціль в тому, що код пишеться раз, і після цього ми можемо звертатися до нього з різних місць програми багаторазово. За допомогою функцій легко тестувати різні рішення. Функції приховують деталі реалізації рішення і ми просто працюємо з ними, майже як з операторами.

Сам блок функції з його реалізацією називається визначенням (defining), а коли ми звертаємося до функції, то говоримо, що викликаємо функцію (calling). Після виклику та виконання функції управління повертається в основну програму, і виконання програми продовжується одразу після того місця, де відбувся виклик. Ми вже стикалися з функціями input, int, float тощо.

Визначення функції починається з ключового слова def, після має йти ім'я функції, далі дужка, що відкриває (, дужка, що закриває ) і знак двокрапки :. Тіло функції починається з нового рядка з потрібним відступом. Python вважає, що знайшов кінець тіла функції, як тільки відступ у рядку стане такого ж рівня, як в оператора def

def hello():
    print('Hello user!')
Саме визначення функції не змусить код виконатись, необхідно виконати виклик функції

def hello():
    print('Hello user!')


hello()  # Hello user!
"""

# Створіть функцію greeting, яка всередині виводить вітальне повідомлення print('Hello world!'). І викличте її.

def greeting():
    print('Hello world!')

# Викликати функцію
greeting()

