'''
Python має особливість, яка називається рядками документації, скорочено docstrings. Це важливий інструмент, який допомагає краще документувати програму та полегшує її розуміння. Рядок у першому логічному рядку функції є рядком документації для цієї функції.

Рядки документації заведено записувати у формі багаторядкового рядка, де перший рядок починається з великої літери та закінчується точкою. Другий рядок залишається порожнім, а докладний опис починається з третього. Рекомендується слідувати такому формату для всіх рядків документації всіх нетривіальних функцій.

Доступ до рядка документації функції можна отримати за допомогою атрибуту функції __doc__. Зверніть увагу на подвійне підкреслення.

def fun(a, b=2, c=3):
    """Знаходить суму трьох параметрів.

     Перший параметр обов'язковий, два інших за замовчанням дорівнюють 2 і 3"""
    return a + b * c

print(fun.__doc__)
'''
'''
Для функції попереднього завдання створіть рядки документації. Можна використовувати наступний шаблон

    """Функція повертає суму за доставлення замовлення.

     Перший параметр &mdash; кількість товарів в замовленні.
     Параметр знижки discount, який передається лише як ключовий, за замовчуванням має значення 0."""
'''
def cost_delivery(quantity, *_, discount=0):
    """
    Функція повертає суму за доставлення замовлення.

    :param quantity: Кількість товарів в замовленні.
    :type quantity: int

    :param discount: Знижка за замовчуванням (значення від 0 до 1), залишається 0, якщо не вказано.
    :type discount: float, optional

    :return: Загальна сума за доставлення з урахуванням знижки.
    :rtype: float
    """
    result = (5 + 2 * max(0, quantity - 1)) * (1 - discount)
    return result
# У цих документаційних рядках вказано типи та призначення параметрів, а також зміст функції та її поверненого значення.

